Revit 2015 API
AnalyticalModel.IsValidSelectorAndDirection Method
 Indicates if the input selector is valid for analytical direction for Analytical Model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to GetAnalyticalProjectionType(), SetAnalyticalProjectionType(), GetAlignmentMethod(), SetAlignmentMethod(), GetAnalyticalProjectionDatumPlane() and SetAnalyticalProjectionDatumPlane() methods that were deprecated and replaced by new ones.")]
public bool IsValidSelectorAndDirection(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to GetAnalyticalProjectionType(), SetAnalyticalProjectionType(), GetAlignmentMethod(), SetAlignmentMethod(), GetAnalyticalProjectionDatumPlane() and SetAnalyticalProjectionDatumPlane() methods that were deprecated and replaced by new ones.")> _
Public Function IsValidSelectorAndDirection ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. It was used as validator to GetAnalyticalProjectionType(), SetAnalyticalProjectionType(), GetAlignmentMethod(), SetAlignmentMethod(), GetAnalyticalProjectionDatumPlane() and SetAnalyticalProjectionDatumPlane() methods that were deprecated and replaced by new ones.")]
public:
bool IsValidSelectorAndDirection(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 Selector of element part
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction which will be validated for the Analytical Model
Return Value
 True if selector is valid for given direction, false otherwise
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace